
POS = {
    "S",            # существительное(яблоня, лошадь, корпус, вечность)
    "A",            # прилагательное(коричневый, таинственный, морской)
    "NUM",          # числительное(четыре, десять, много)
    "ANUM",         # числительное - прилагательное(один, седьмой, восьмидесятый)
    "V",            # глагол(пользоваться, обрабатывать)
    "ADV",          # наречие(сгоряча, очень)
    "PRAEDIC",      # предикатив(жаль, хорошо, пора)
    "PARENTH",      # вводное слово(кстати, по - моему)
    "SPRO",         # местоимение - существительное(она, что)
    "APRO",         # местоимение - прилагательное(который, твой)
    "ADVPRO",       # местоименное наречие(где, вот)
    "PRAEDICPRO",   # местоимение - предикатив(некого, нечего)
    "PR",           # предлог(под, напротив)
    "CONJ",         # союз(и, чтобы)
    "PART",         # частица(бы, же, пусть)
    "INTJ"          # междометие(увы, батюшки)
}

gender = {
    "m",    # мужской род (работник, стол)
    "f",    # женский род (работница, табуретка)
    "m-f",  # «общий род» (задира, пьяница)
    "n"     # средний род (животное, озеро)
}

anim = {
    "anim",     # одушевленность (человек, ангел, утопленник)
    "inan"      # неодушевленность (рука, облако, культура)
}

number = {
    "sg",   # единственное число (яблоко, гордость)
    "pl"    # множественное число (яблоки, ножницы, детишки)
}

case = {
    "nom",      # именительный падеж (голова, сын, степь, сани, который)
    "gen",      # родительный падеж (головы, сына, степи, саней, которого)
    "dat",      # дательный падеж (голове, сыну, степи, саням, которому)
    "dat2",     # дистрибутивный дательный ([по] многу, нескольку, стольку)
    "acc",      # винительный падеж (голову, сына, степь, сани, который/которого)
    "ins",      # творительный падеж (головой, сыном, степью, санями, которым)
    "loc",      # предложный падеж ([о] голове, сыне, степи, санях, котором)
    "gen2",     # второй родительный падеж (чашка чаю)
    "acc2",     # второй винительный падеж (постричься в монахи; по два человека)
    "loc2",     # второй предложный падеж (в лесу, на оси́)
    "voc",      # звательная форма (Господи, Серёж, ребят)
    "adnum"     # счётная форма (два часа́, три шара́)
}

brevity = {
    "brev",     # краткая форма (высок, нежна, прочны, рад) (brevity)
    "plen"      # полная форма (высокий, нежная, прочные, морской) (plenary)
}

comp = {
    "comp",     # сравнительная степень (глубже)
    "comp2",    # форма «по+сравнительная степень» (поглубже)
    "supr"      # превосходная степень (глубочайший)
}

aspect = {
    "pf",   # cовершенный вид (пошёл, встречу) (perfect)
    "ipf"   # несовершенный вид (ходил, встречаю) (inperfect)
}

transitive = {
    "intr",     # непереходность (ходить, вариться)
    "tran"      # переходность (вести, варить)
}

voice = {
    "act",      # действительный залог (разрушил, разрушивший)
    "pass",     # страдательный залог (только у причастий: разрушаемый, разрушенный)
    "med"       # медиальный, или средний залог (глагольные формы на -ся: разрушился и т.п.)
}

form = {
    "inf",      # инфинитив (украшать)
    "partcp",   # причастие (украшенный)
    "ger"       # деепричастие (украшая)
}

mood = {
    "indic",    # изъявительное наклонение (украшаю, украшал, украшу)
    "imper",    # повелительное наклонение (украшай)
    "imper2"    # форма повелительного наклонения 1 л. мн. ч. на -те (идемте)
}

tense = {
    "praet",    # прошедшее время (украшали, украшавший, украсив)
    "praes",    # настоящее время (украшаем, украшающий, украшая)
    "fut",      # будущее время (украсим)
}

person = {
    "1p",   # первое лицо (украшаю)
    "2p",   # второе лицо (украшаешь)
    "3p"    # третье лицо (украшает)
}

other = {
    "persn",    # личное имя (Иван, Дарья, Леопольд, Эстер, Гомер, Маугли)
    "patrn",    # отчество (Иванович, Павловна)
    "famn",     # фамилия (Николаев, Волконская, Гумбольдт)
    "zoon",     # кличка животного (Шарик, Дочка)
    "0"        # несклоняемое (шоссе, Седых)
}

special = {
    "anom",     # («Аномальная форма») — различного рода морфологические аномалии, возможные у устаревших или
                # просторечных нелитературных форм (три дни при нормативном три дня, ляжь при нормативном ляг)
    "distort",  # («Искаженная форма»)  — орфографическое и/или фонетическое искажение слова, часто передающее
                # различные особенности произношения (дэвушка, това’ищи, про-хо-ди, низнаю).
    "ciph",     # («Цифровая запись»)  — запись числительного, числительного-прилагательного или прилагательного
                # (полностью или частично) при помощи цифр (73, LXXIII, 73-й, 22-летний). Для этих словоформ в поле
                # «Лексема» также употребляется цифровая запись; число и падеж указываются только в тех случаях,
                # когда выписано окончание (типа 14-му).
    "INIT",     # («Инициал»)  — запись вида «заглавная буква с точкой» (М., Р.). В поле «Лексема» инициал не
                # раскрывается; грамматические признаки не указываются.
    "abbr"      # («Сокращение»)  — сокращенная запись (тов., гг., ч.). В поле «Лексема» сокращение (кроме инициалов)
                # раскрывается, указывается грамматическая форма, соответствующая контексту. Специально отметим,
                # что акронимы вроде ООН, вуз и усеченные слова вроде зав, зам, записываемые без точки и не
                # раскрываемые при чтении, не получают пометы abbr и трактуются как обычные слова
                # (склоняемые или несклоняемые).
}
